---
kind: type
id: T:Autodesk.Revit.DB.CeilingType
source: html/baf38810-8834-27b6-23fa-1a695daabe47.htm
---
# Autodesk.Revit.DB.CeilingType

Represents a ceiling type in Autodesk Revit.

## Syntax (C#)
```csharp
public class CeilingType : HostObjAttributes
```